{
  "content": "# Peer Review System UI Notes\n\n## Login screen\n\nUse *cancel* rather than *reset*\nSandhya comments: Will change reset to cancel\n\n## Teacher interface after login\n\nShould we just start with a single course per deployment, i.e., one can just make multiple deployments for multiple courses to simplify.  Your choice.\nSandhya comments: Starting with one course for now.\n\n## Create task\n\nLooks like a good start.\nSandhya comments: :)\n\n## Student Interface After Login\n\nSame question as teacher do we need to manage multiple courses at this point in time?\n\nSandhya comments: Starting with one course for now.\n\n## Student Interface After Selecting Course\n\nIn the project slides we had gone from a \"question/answer\" creator to a \"Peer Review System\" with submissions and peer grading of submission.  This UI looks like it is organized around the earlier Q&A based project.  Which did you intend? \n\nI thought we would allow the student to submit any assignment in Markdown + images format rather than strictly Q&A submissions. We wouldn't need to track individual questions and such.\n\nSandhya comments: I was thinking of adding the question/answer part as well. But as you said, peer review is our main goal. I will edit this interface.\n\n\n## Student Review Interface\n\nI was thinking each student has multiple reviews to do. Teacher furnishes grading criteria/instructions (also known as a rubric for students) and students assign points to items and make comments.\n\nSandhya comments: Students can do multiple reviews. Will make edits based on your comments.\n\n## Teacher interface 8.0\n\nI think this is kind of what we want, i.e., original submission, and review side by side when teacher needs to check on review. But the first thing would to be a summary of all the reviews for a given students work, or a table. That way a teacher can easily check for outliers.\n\nSandhya comments: Will edit this interface to view a summary of reviews.",
  "fileName": "aaareacttest.md",
  "uploadedOn": "2019-11-01T19:29:15.216Z"
}